Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/RTC_old/RTC_old.tmx
Source language: en_us
Languages: de_de

source: The method of claim 10, 11 or 12, further comprising the steps of:
de_de: Verfahren nach Anspruch 10, 11 oder 12, ferner umfassend die Schritte:

source: identifying a fault on one or more of the plurality of second-axis interconnects (54); and
de_de: Identifizieren eines Fehlers auf einer oder mehreren der Vielzahl von Zweitachsen-Zwischenverbindungen (54); und

source: interrogating any of the plurality of sensors by enabling an associated first-axis interconnect (52) and an associated second-axis interconnect (54).
de_de: Abfragen eines beliebigen Sensors aus der Vielzahl von Sensoren durch Aktivieren einer zugehörigen Erstachsen-Zwischenverbindung (52) und einer zugehörigen Zweitachsen-Zwischenverbindung (54).

source: 1. A stator assembly (2) for an electrical machine, the stator assembly (2) comprising:
de_de: 1. Statorbaugruppe (2) für eine elektrische Maschine, die Statorbaugruppe (2) umfassend:

source: an annular core (4) extending around an axis (X) and comprising a plurality of axially extending slots (6);
de_de: einen ringförmigen Kern (4), der sich um eine Achse (X) erstreckt und eine Vielzahl von sich axial erstreckenden Nuten (6) umfasst;

source: a plurality of electrical windings (8) arranged in the slots (6) and having end portions (10) arranged at the axial ends (12) of the core (4); and
de_de: eine Vielzahl elektrischer Wicklungen (8), die in den Nuten (6) angeordnet sind und Endabschnitte (10) aufweisen, die an den axialen Enden (12) des Kerns (4) angeordnet sind; und

source: at least one annular cooling plate (40) mounted at an axial end (12) of the core (4), wherein
de_de: mindestens eine ringförmige Kühlplatte (40), die an einem axialen Ende (12) des Kerns (4) angebracht ist, wobei

source: the at least one annular cooling plate (40) is arranged in direct thermal contact with axially outwardly facing end surfaces (80) of the end portions (10) of the electrical windings (8),
de_de: die mindestens eine ringförmige Kühlplatte (40) in direktem thermischen Kontakt mit axial nach außen weisenden Endflächen (80) der Endabschnitte (10) der elektrischen Wicklungen (8) angeordnet ist,

source: characterised in that the at least one annular cooling plate (40) is removably mounted to the rest of the stator assembly (2).
de_de: dadurch gekennzeichnet, dass die mindestens eine ringförmige Kühlplatte (40) abnehmbar an der übrigen Statorbaugruppe (2) angebracht ist.

source: 2. The stator assembly of claim 1, further comprising a cooling jacket (14) at least partially extending around a radially outer surface (13) of the core (4), the at least one annular cooling plate (40) being mounted to an axial end (42) of the cooling jacket.
de_de: 2. Statorbaugruppe nach Anspruch 1, ferner umfassend einen Kühlmantel (14), der sich mindestens teilweise um eine radiale äußere Oberfläche (13) des Kerns (4) erstreckt, wobei die mindestens eine ringförmige Kühlplatte (40) an einem axialen Ende (42) des Kühlmantels angebracht ist.

source: 3. The stator assembly of claim 2, wherein the at least one cooling plate (40) is mounted to the cooling jacket (14) via a fastener (44) for example a threaded fastener (44).
de_de: 3. Statorbaugruppe nach Anspruch 2, wobei die mindestens eine Kühlplatte (40) über ein Befestigungselement (44), beispielsweise ein Gewindebefestigungselement (44), an dem Kühlmantel (14) angebracht ist.

source: 4. The stator assembly of claim 1, 2 or 3, comprising a respective cooling plate (40) provided at each axial end of the stator (2).
de_de: 4. Statorbaugruppe nach Anspruch 1, 2 oder 3, umfassend jeweils eine Kühlplatte (40), die an jedem axialen Ende des Stators (2) bereitgestellt ist.

source: 5. The stator assembly of any preceding claim, wherein the at least one cooling plate (40) comprises a cooling passage (60) configured to carry a cooling fluid.
de_de: 5. Statorbaugruppe nach einem der vorhergehenden Ansprüche, wobei die mindestens eine Kühlplatte (40) einen Kühlkanal (60) umfasst, der konfiguriert ist, ein Kühlfluid zu führen.

source: 6. The stator assembly of claim 5, wherein the at least one cooling plate (40) comprises a base element (54) defining a groove (56) and a cover (58) attached to the base element (54) for closing the groove (56) to form the cooling passage (60).
de_de: 6. Statorbaugruppe nach Anspruch 5, wobei die mindestens eine Kühlplatte (40) ein Basiselement (54), das eine Nut (56) definiert, sowie eine an dem Basiselement (54) befestigte Abdeckung (58) zum Verschließen der Nut (56) umfasst, um den Kühlkanal (60) auszubilden.

source: 7. The stator assembly of claim 5 or 6, wherein the at least one cooling plate (40) comprises heat transfer enhancement features (68) which extend into the cooling passage (60), optionally extending completely across the cooling passage (60).
de_de: 7. Statorbaugruppe nach Anspruch 5 oder 6, wobei die mindestens eine Kühlplatte (40) Wärmeübertragungsverbesserungsmerkmale (68) umfasst, die sich in den Kühlkanal (60) erstrecken und sich optional vollständig durch den Kühlkanal (60) erstrecken.

source: 8. The stator assembly of claim 7, wherein the heat transfer enhancement features (68) comprise ribs (70) and/or pin fins (72).
de_de: 8. Statorbaugruppe nach Anspruch 7, wobei die Wärmeübertragungsverbesserungsmerkmale (68) Rippen (70) und/oder Stiftlamellen (72) umfassen.

source: 9. The stator assembly of claim 8, wherein the pin fins (72) comprise a square, rectangular, diamond shaped, oval or teardrop cross-section.
de_de: 9. Statorbaugruppe nach Anspruch 8, wobei die Stiftlamellen (72) einen quadratischen, rechteckigen, rautenförmigen, ovalen oder tropfenförmigen Querschnitt umfassen.

source: The stator assembly of any of claims 5 to 9, wherein the at least one cooling plate (40) comprises at least one cooling fluid inlet (62) and at least one cooling fluid outlet (64), and wherein the at least one fluid inlet (62) is located on a diametrically opposite side of the at least one cooling plate (40) from the at least one fluid outlet (64).
de_de: Statorbaugruppe nach einem der Ansprüche 5 bis 9, wobei die mindestens eine Kühlplatte (40) mindestens einen Kühlfluideinlass (62) und mindestens einen Kühlfluidauslass (64) umfasst und wobei sich der mindestens eine Fluideinlass (62) auf einer dem mindestens einen Fluidauslass (64) diametral gegenüberliegenden Seite der mindestens einen Kühlplatte (40) befindet.

source: The stator assembly of any preceding claim, wherein the at least one cooling plate (40) is formed from aluminium.
de_de: Statorbaugruppe nach einem der vorhergehenden Ansprüche, wobei die mindestens eine Kühlplatte (40) aus Aluminium ausgebildet ist.

source: A method of assembling a stator assembly (2) for an electrical machine according to any of the preceding claims, the stator assembly (2) comprising an annular core (4) extending around an axis (X) and comprising a plurality of axially extending slots (6); and a plurality of electrical windings (8) arranged in the slots (6) and having end portions (10) at axial ends (12) of the core (4); the method comprising the step of:
de_de: Verfahren des Zusammenbauens einer Statorbaugruppe (2) für eine elektrische Maschine nach einem der vorhergehenden Ansprüche, die Statorbaugruppe (2) umfassend einen ringförmigen Kern (4), der sich um eine Achse (X) erstreckt und eine Vielzahl von sich axial erstreckenden Nuten (6) umfasst; und eine Vielzahl von elektrischen Wicklungen (8), die in den Nuten (6) angeordnet sind und Endabschnitte (10) an axialen Enden (12) des Kerns (4) aufweisen; das Verfahren den folgenden Schritt umfassend:

source: mounting at least one annular cooling plate (40) at an axial end (12) of the core (4) in direct thermal contact with axially facing surfaces of the end portions (10) of the electrical windings (8),
de_de: Anbringen mindestens einer ringförmigen Kühlplatte (40) an einem axialen Ende (12) des Kerns (4) in direktem thermischen Kontakt mit axial weisenden Oberflächen der Endabschnitte (10) der elektrischen Wicklungen (8),

source: The method of claim 12, wherein attaching the at least one cooling plate (40) at an axial end (12) of the core (4) comprises mounting the cooling plate (40) to a cooling jacket (14) which at least partially extends around a radially outer surface (13) of the core (4), optionally attaching the cooling plate (40) to the cooling jacket (14) using threaded fasteners (44).
de_de: Verfahren nach Anspruch 12, wobei Befestigen der mindestens einen Kühlplatte (40) an einem axialen Ende (12) des Kerns (4) umfasst, die Kühlplatte (40) an einem Kühlmantel (14) anzubringen, der sich mindestens teilweise um eine radiale äußere Oberfläche (13) des Kerns (4) erstreckt, und optional die Kühlplatte (40) mittels Gewindebefestigungselementen (44) an dem Kühlmantel (14) zu befestigen.

source: The method of claim 12 or 13, further comprising leak testing and/or electrically testing the assembled stator assembly (2) after attaching the at least one cooling plate (40) to the stator assembly (2).
de_de: Verfahren nach Anspruch 12 oder 13, ferner umfassend Dichtheitsprüfen und/oder elektrisches Prüfen der zusammengebauten Statorbaugruppe (2) nach dem Befestigen der mindestens einen Kühlplatte (40) an der Statorbaugruppe (2).

source: The method of any of claims 12 to 14, further comprising removing the at least one cooling plate (40) to carry out maintenance on the stator assembly (2).
de_de: Verfahren nach einem der Ansprüche 12 bis 14, ferner umfassend das Abnehmen der mindestens einen Kühlplatte (40), um Wartungsarbeiten an der Statorbaugruppe (2) durchzuführen.

source: CLAIMS:
de_de: PATENTANSPRÜCHE:

source: 1. A system (12) for detecting characteristics of an airstream moving over an airfoil surface (18) of an aircraft (10), the system comprising:
de_de: 1. System (12) zur Erfassung von Eigenschaften eines Luftstroms, der sich über eine Tragflächenoberfläche (18) eines Flugzeugs (10) bewegt, wobei das System Folgendes umfasst:

source: ‎the airfoil surface (18);
de_de: ‎die Tragflächenoberfläche (18);

source: ‎an ultrasonic emitter (34) attached to the airfoil surface (18) of the aircraft, the ultrasonic emitter configured to emit an ultrasonic pulse into the airstream over the airfoil surface of the aircraft;‎
de_de: ‎einen Ultraschallemitter (34), der an der Tragflächenoberfläche (18) des Flugzeugs angebracht ist, wobei der Ultraschallemitter konfiguriert ist, um einen Ultraschallimpuls in den Luftstrom über der Tragflächenoberfläche des Flugzeugs zu emittieren;‎

source: a plurality of acoustic transducers (14A-D) positioned along the airfoil surface along a path, each of the plurality of acoustic transducers being configured to detect acoustic waves indicative of an airstream condition proximate the acoustic transducer; and
de_de: eine Vielzahl von Schallwandlern (14A-D), die entlang der Tragflächenoberfläche entlang eines Pfades positioniert ist, wobei jeder der Vielzahl von Schallwandlern konfiguriert ist, um Schallwellen zu erfassen, die einen Luftstromzustand in der Nähe des Schallwandlers angeben; und

source: ‎a processor (16) configured to determine, for each of the sequence of acoustic transducers, a level of turbulence in the airstream proximate the acoustic transducer based on the acoustic waves detected; wherein the plurality of acoustic transducers are positioned in a sequence along the path from a first location proximate a leading edge of the airfoil surface to a last location proximate a trailing edge of the airfoil surface; wherein the path is along the airstream over the airfoil surface and is coplanar with a plane that cross-sections the airfoil surface; wherein the level of turbulence in the airstream proximate the acoustic transducer is determined by comparing amplitude and/or spectral content of the acoustic wave detected that is within a turbulence-sensitivity frequency band with an amplitude threshold and/or a spectral content reference, respectively.
de_de: ‎einen Prozessor (16), der konfiguriert ist, um für jeden Schallwandler in der Folge von Schallwandlern basierend auf den erfassten Schallwellen einen Turbulenzgrad in dem Luftstrom in der Nähe des Schallwandlers zu bestimmen; wobei die Vielzahl von Schallwandlern in einer Folge entlang des Pfads von einer ersten Position in der Nähe einer Vorderkante der Tragflächenoberfläche zu einer letzten Position in der Nähe einer Hinterkante der Tragflächenoberfläche positioniert ist; wobei der Pfad entlang des Luftstroms über der Tragflächenoberfläche ist und koplanar mit einer Ebene ist, die die Tragflächenoberfläche schneidet; wobei der Turbulenzgrad in dem Luftstrom in der Nähe des Schallwandlers durch Vergleichen der Amplitude und/oder des spektralen Inhalts der erfassten Schallwelle, die innerhalb eines turbulenzempfindlichen Frequenzbands ist, mit entsprechend einem Amplitudenschwellenwert und/oder einer Referenz des spektralen Inhalts bestimmt wird.

source: 2. The system of claim 1, wherein the processor is further configured to determine a point of flow separation along the path based on the determined level of turbulence and on corresponding ones of the plurality of acoustic transducers whose detected acoustic waves are indicative of the determined level of turbulence.
de_de: 2. System nach Anspruch 1, wobei der Prozessor ferner konfiguriert ist, einen Punkt von Grenzschichtablösung entlang des Pfads basierend auf dem bestimmten Turbulenzgrad und auf entsprechenden der Vielzahl von Schallwandlern zu bestimmen, deren erfasste Schallwellen für den erfassten Turbulenzgrad angebend sind.

source: 3. The system of any preceding claim, wherein the processor is further configured to generate an output signal indicative of the detected airstream characteristics in response to detected level of turbulence in the airstream proximate the acoustic transducer.
de_de: 3. System nach einem der vorhergehenden Ansprüche, wobei der Prozessor ferner konfiguriert ist, als Reaktion auf den erfassten Turbulenzgrad in dem Luftstrom in der Nähe des Schallwandlers ein Ausgangssignal zu erzeugen, das für die erfassten Luftstromeigenschaften angebend ist.

source: 4. The system of any preceding claim, wherein the ultrasonic emitter is positioned along the path.
de_de: 4. System nach einem der vorhergehenden Ansprüche, wobei der Ultraschallemitter entlang des Pfads positioniert ist.

source: 5. The system of any preceding claim, wherein each of the sequence of acoustic transducers (14A-D) is further configured to detect the ultrasonic pulse emitted into the airstream.
de_de: 5. System nach einem der vorhergehenden Ansprüche, wobei jeder der Schallwandler (14A-D) ferner konfiguriert ist, um den in den Luftstrom emittierten Ultraschallimpuls zu erfassen.

source: 6. The system of any preceding claim, wherein an upstream one (14A) of the sequence of acoustic transducers is configured to be attached upstream of the ultrasonic emitter, and a downstream one (14B-D) of the sequence of acoustic transducers is configured to be attached downstream of the ultrasonic emitter.
de_de: 6. System nach einem der vorhergehenden Ansprüche, wobei ein in der Folge von Schallwandlern vorgeschalteter Schallwandler (14A) konfiguriert ist, um dem Ultraschallemitter vorgeschaltet angebracht zu werden, und ein in der Folge von Schallwandlern nachgeschalteter Schallwandler (14B-D) konfiguriert ist, um dem Ultraschallemitter nachgeschaltet angebracht zu werden.

source: 7. The system of any preceding claim, wherein the processor (16) is further configured to determine local boundary layer velocity between adjacent pairs of the sequence of acoustic transducers (14A-D) based on times of detection of the ultrasonic pulses detected by the acoustic transducers (14A-D).
de_de: 7. System nach einem der vorhergehenden Ansprüche, wobei der Prozessor (16) ferner konfiguriert ist, eine lokale Grenzschichtgeschwindigkeit zwischen benachbarten Paaren in der Folge von Schallwandlern (14A-D) basierend auf Erfassungszeitpunkten der von den Schallwandlern (14A-D) erfassten Ultraschallimpulse zu bestimmen.

source: 8. The system of claim 7, wherein the local boundary layer velocity of the aircraft between adjacent pairs of the sequence of acoustic transducers (14A-D) is determined as:
de_de: 8. System nach Anspruch 7, wobei die lokale Grenzschichtgeschwindigkeit des Flugzeugs zwischen benachbarten Paaren in der Folge von Schallwandlern (14A-D) wie folgt bestimmt wird:

source: where dn-dn-1 is a distance between the nth and (n-1)th pair of adjacent acoustic transducers, τd-τd-1 is the time difference between detection of the ultrasonic pulse the nth and (n-1)th pair of adjacent acoustic transducers, and c is the speed of sound in the airstream moving over the airfoil surface.
de_de: wobei dn-dn-1 der Abstand zwischen dem n-ten und (n-1)-ten Paar benachbarter Schallwandler ist, τd-τd-1 die Zeitdifferenz zwischen der Erfassung des Ultraschallimpulses des n-ten und (n-1)-ten Paares benachbarter Schallwandler ist und c die Schallgeschwindigkeit in dem Luftstrom ist, der sich über die Tragflächenoberfläche bewegt.

source: 9. A method for detecting turbulence of an airstream over an airfoil surface (18) of an aircraft (10), the method comprising:
de_de: 9. Verfahren zur Erfassung von Turbulenzen eines Luftstroms über einer Tragflächenoberfläche (18) eines Flugzeugs (10), wobei das Verfahren Folgendes umfasst:

source: ‎emitting, via an ultrasonic emitter (34) attached to the airfoil surface (18) of the aircraft (10), an ultrasonic pulse into the airstream over the airfoil surface of the aircraft;
de_de: ‎Emittieren eines Ultraschallimpulses in den Luftstrom über der Tragflächenoberfläche des Flugzeugs über einen an der Tragflächenoberfläche (18) des Flugzeugs (10) angebrachten Ultraschallemitter (34);

source: ‎detecting, by a sequence of acoustic transducers (14A-D) attached to an airfoil surface (18) of the aircraft (10) along a path, acoustic wave indicative of airstream condition proximate the acoustic transducer; and‎
de_de: ‎Erfassen einer Schallwelle, die für den Zustand des Luftstroms in der Nähe des Schallwandlers angebend ist, durch eine Folge von Schallwandlern (14A-D), die entlang eines Pfades an einer Tragflächenoberfläche (18) des Flugzeugs (10) angebracht sind; und‎

source: determining, via a processor (16), a level of turbulence in the airstream proximate each of the sequence of acoustic transducers based on the acoustic wave detected; wherein the plurality of acoustic transducers are attached in a sequence to the airfoil surface along a path from a first location proximate a leading edge of the airfoil surface to a last location proximate a trailing edge of the airfoil surface, the path being along the airstream over the airfoil surface (20) and is coplanar with a plane that cross-sections the airfoil surface, wherein determining a level of turbulence in the airstream comprises comparing amplitude and/or spectral content of the acoustic wave detected that is within a turbulence-sensitivity frequency band with an amplitude threshold and/or a spectral content reference, respectively.
de_de: Bestimmen eines Turbulenzgrads in dem Luftstrom in der Nähe jedes Schallwandlers in der Folge von Schallwandlern über einen Prozessor (16) basierend auf der erfassten Schallwelle; wobei die Vielzahl von Schallwandlern in einer Folge an der Tragflächenoberfläche entlang eines Pfades von einer ersten Position in der Nähe einer Vorderkante der Tragflächenoberfläche zu einer letzten Position in der Nähe einer Hinterkante der Tragflächenoberfläche angebracht ist, wobei der Pfad entlang des Luftstroms über der Tragflächenoberfläche (20) ist und koplanar mit einer Ebene ist, die die Tragflächenoberfläche schneidet, wobei ein Bestimmen eines Turbulenzgrads in dem Luftstrom das Vergleichen der Amplitude und/oder des spektralen Inhalts der erfassten Schallwelle, die innerhalb eines turbulenzempfindlichen Frequenzbandes ist, mit entsprechend einem Amplitudenschwellenwert und/oder einer Referenz des spektralen Inhalts umfasst.

source: The method of claim 9, wherein determining a level of turbulence in the airstream further comprises:‎
de_de: Verfahren nach Anspruch 9, wobei ein Bestimmen eines Turbulenzgrads in dem Luftstrom ferner umfasst:‎

source: generating, via the processor, an output signal indicative of the detected airstream characteristics in response to detected level of turbulence in the airstream proximate the acoustic transducer.
de_de: Erzeugen eines Ausgangssignals über den Prozessor, das für die erfassten Luftstromeigenschaften als Reaktion auf den erfassten Turbulenzgrad in dem Luftstrom in der Nähe des Schallwandlers angebend ist.

source: The method of claim 9 or 10, further comprising:‎
de_de: Verfahren nach Anspruch 9 oder 10, ferner umfassend:‎

source: detecting, via each of the sequence of acoustic transducers (14A-D), the ultrasonic pulse emitted into the airstream.
de_de: Erfassen des in den Luftstrom emittierten Ultraschallimpulses über jeden Schallwandler der Folge von Schallwandlern (14A-D).

source: The method of claim 11, further comprising:‎
de_de: Verfahren nach Anspruch 11, ferner umfassend:‎

source: determining, by the processor (16), local boundary layer velocity between adjacent pairs of the sequence of acoustic transducers (14A-D) based on times of detection of the ultrasonic pulses detected by the acoustic transducers; optionally
de_de: Bestimmen einer lokalen Grenzschichtgeschwindigkeit zwischen benachbarten Paaren in der Folge von Schallwandlern (14A-D) durch den Prozessor (16) basierend auf Erfassungszeitpunkten der von den Schallwandlern erfassten Ultraschallimpulse; optional

source: ‎wherein the local boundary layer velocity of the aircraft between adjacent pairs of the sequence of acoustic transducers (14A-D) is determined as:
de_de: ‎wobei die lokale Grenzschichtgeschwindigkeit des Flugzeugs zwischen benachbarten Paaren in der Folge von Schallwandlern (14A-D) wie folgt bestimmt wird:

source: 1. A signal processing system, comprising;
de_de: 1. Signalverarbeitungssystem, umfassend;

source: a plurality of processing modules (103a-p) configured to process raw sensor data from a sensor (101) to output processed sensor data;
de_de: eine Vielzahl von Verarbeitungsmodulen (103a-p), die dazu konfiguriert sind, rohe Sensordaten von einem Sensor (101) zu verarbeiten, um verarbeitete Sensordaten auszugeben;

source: a state module (105a-p) for each processing module (103a-p) operative to cause a respective processing module (103a-p) to receive and process the sensor data; and
de_de: ein Zustandsmodul (105a-p) für jedes Verarbeitungsmodul (103a-p), das dazu dient, ein jeweiliges Verarbeitungsmodul (103a-p) zu veranlassen, die Sensordaten zu empfangen und zu verarbeiten; und

source: a control module (107) configured to receive a coded bitstring (109) and activate or deactivate a predefined set of state modules (105a-p) based on the coded bitstring (109) to control which processing modules (103a-p) process the sensor data and/or to control an order of processing;
de_de: ein Steuermodul (107), das dazu konfiguriert ist, eine codierte Bitfolge (109) zu empfangen und basierend auf der codierten Bitfolge (109) einen vordefinierten Satz von Zustandsmodulen (105a-p) zu aktivieren oder zu deaktivieren, um zu steuern, welche Verarbeitungsmodule (103a-p) die Sensordaten verarbeiten und/oder um eine Reihenfolge der Verarbeitung zu steuern;
